[
  {
    "urlTag": "wood-block-tap-away",
    "title": "Wood Block Tap Away 🎯 Click here to play for free",
    "name": "Wood Block Tap Away",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/wood-block-tap-away/orig.gif ",
    "shortDesc": "So put your logic and critical thinking skills to the test with this highly engaging and fun Tap Away 3D Wood Block Puzzle!",
    "description": "Unleash your puzzle-solving potential and start playing Tap Away 3D Wood Block Puzzle now! In this challenging block game, you must push all the blocks out of the way to clear the screen. The blocks won't move unless they are facing the right direction, and you need to strategize carefully and rotate the shapes by swiping your finger on the screen to find the best angle. As you progress, the block shapes will get bigger and the level shapes will change, which increases the difficulty of solving the puzzles. So put your logic and critical thinking skills to the test with this highly engaging and fun Tap Away 3D Wood Block Puzzle!",
    "gameUrl": "https://cdn.thornandballoons.net/games/wood-block-tap-away/index.html",
    "howToPlay": "Tap on cubes and make them fly away!\n\nYou must push all the blocks out of the way to clear the screen. The blocks will not move unless facing the right direction, and you need to strategize carefully and rotate the shapes by sliding your finger across the screen to find the best angle. As you progress, the block shapes will become larger and the level shape will change, increasing the difficulty of solving the puzzles.",
    "features": "About game features \nTap Wood Blocks Away is an addictive and entertaining block puzzle game that will help you relax and forget about everyday worries. The rules are simple: tap on the arrows to move the blocks and clear the screen. But be careful, because the blocks can block each other from moving."
  },
  {
    "urlTag": "throne-vs-balloons-timer-countdown-game",
    "title": "Play Throne vs Balloons - Timer Countdown Game",
    "name": "Throne vs Balloons - Timer Countdown Game",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/banner-throne-vs-balloons-timer-countdown-game.jpg",
    "shortDesc": "In this timer countdown game, you have only seconds to complete the challenge. Control a spiked ball to break obstacles and pop balloons. Test your focus and agility!",
    "description": "In this fast-paced timer countdown game, you have just tens of seconds to complete the challenge. Your focus and agility will be tested as you control a bouncing ball equipped with sharp spikes. Use it to break through obstacles and pop balloons. The clock is ticking—can you beat the time?",
    "gameUrl": "https://cdn.thornandballoons.net/games/throne-vs-balloons-timer-countdown-game/index.html",
    "howToPlay": "The gameplay of Throne vs Balloons is as follows: click the play now button, wait for the game to load, use gestures to slide the screen to aim at the balloons, and a countdown will be displayed in the upper left corner of the game. Pop all the balloons before the countdown reaches 0. The less time you spend, the higher your score.",
    "features": "Throne vs Balloons game level introduction, the first level is relatively simple, the later level will add rising air currents, when the dart passes through the rising air currents, the movement trajectory will be changed, which makes it more difficult to burst the balloon target. You need to pay attention to the direction of the thrown dart."
  },
  {
    "urlTag": "kids-balloon-pop-classic-balloon-popping-game",
    "title": "Play Balloon Pop for Kids: Classic Balloon Popping Game",
    "name": "Kids Balloon Pop - Classic balloon popping game",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/banner-kids-balloon-pop-classic-balloon-popping-game.jpg",
    "shortDesc": "Play Balloons Pop online for free! This Tetris-inspired game lets you connect 3 or more same-colored balloons to pop them. It's works on any device.",
    "description": "This classic balloon-popping game is perfect for kids! With colorful graphics, cute animals, and various backgrounds, it’s fun and educational. Kids can learn English or practice vocabulary in 10 languages. You can adjust balloon speed and size to match your child’s skill level. It’s relaxing, works offline, and has been updated in 2025!",
    "gameUrl": "https://cdn.thornandballoons.net/games/kids-balloon-pop-classic-balloon-popping-game/index.html",
    "howToPlay": "Balloon Pop is a game similar to Tetris. You need to stack balloons of the same color to 3, and then you can eliminate the three balloons. The falling speed of the balloons will increase with the change of the level. If the balloons accumulate to the top, it means the game fails.",
    "features": "Balloon Pop level description, this is an endless game, the score will be accumulated to see who has the higher score."
  },
  {
    "urlTag": "pop-balloons-emojis-match-game",
    "title": "Play Balloon Pop Emoji Matching Game",
    "name": "Balloon Pop Emoji Matching Game",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/banner-pop-balloons-emojis-match-game.jpg",
    "shortDesc": "Link 3 or more same-colored emojis in any direction! Clear the goal within limited moves. Pop bubbles around boxes or evil emojis to destroy them.",
    "description": "Link 3+ same-colored emojis in any direction to clear them! Reach your goal within the limited moves. Pop bubbles around boxes or evil emojis to destroy them. Use power-ups to boost your chances of winning!",
    "gameUrl": "https://cdn.thornandballoons.net/games/pop-balloons-emojis-match-game/index.html",
    "howToPlay": "BALLOON BURN EMOJI MATCHING GAMEPLAY Connect 3 or more emojis of the same color to blast them! Connect 10 to get a Super Merge! Connect 3 or more emojis of the same color! Connect them in any direction to connect all of them! Reach the goal within a limited number of moves Pop the bubbles around the box or evil emojis to destroy them Use power-ups to complete your mission!",
    "features": "Link 3 or more same color to pop Emojies! Link 10 and get ultra merge!"
  },
  {
    "urlTag": "balloon-bubble-burst-brain-game",
    "title": "Balloon Bubble Burst - Click here to play for free",
    "name": "Balloon Bubble Burst",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/banner-balloon-bubble-burst-brain-game.png",
    "shortDesc": "Balloon Bubble Burst is a 2D puzzle game. Destroy bubbles with balls. Aim straight or bounce off walls to clear levels with fewer balls. Challenge yourself with dozens of levels!",
    "description": "Balloon Bubble Burst is a fun and challenging 2D bubble shooter physics puzzle game. You have to destroy all bubbles with falling balls. You can aim at bubbles in a straight line and release the ball. You can also let the ball bounce off the walls to hit more bubbles with one ball. Can you destroy all bubbles? Dozens of levels are waiting for you! Use your brain and try to complete all levels with the least number of balls!",
    "gameUrl": "https://cdn.thornandballoons.net/games/balloon-bubble-burst-brain-game/index.html",
    "howToPlay": "The gameplay of this game is as follows: after opening the game, you will see many balloons on the interface. You can click on an area at will, and a straight line will appear. This straight line is the trajectory of the dart. When the dart touches the balloon, it will be affected by the corresponding force according to the collision position and change its trajectory. The number of darts is limited, and you need to burst all the balloons before the darts run out.",
    "features": "Function introduction, pop balloons, adjust sound on the main interface, etc."
  },
  {
    "urlTag": "thief-puzzle",
    "title": "Thief Puzzle - Click here to play for free",
    "name": "Thief Puzzle",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/thief-puzzle/thief-puzzle_16x9-cover.avif",
    "shortDesc": "Thief Puzzle is a clever 2D puzzle logic game that tests your problem-solving skills and strategy. You control the hand of a cunning thief as he reaches for precious treasure, but the path is filled with complex traps, laser security systems, and tricky obstacles. Are you good enough to escape each trap?",
    "description": "Thief Puzzle is a clever 2D puzzle logic game that tests your problem-solving skills and strategy. You control the hand of a cunning thief as he reaches for precious treasure, but the path is filled with complex traps, laser security systems, and tricky obstacles. Are you good enough to escape each trap?In Thief Puzzle you need to perform a series of sneaky heists in a variety of zany scenarios. At first you need to test your skills in simple situations: snatch a purse from an old woman sitting on a bench, or grab groceries from two unsuspecting women on a ledge. As you progress through the game, the challenges escalate. You can even steal the suitcases of tourists while they admire the Eiffel Tower, or outsmart a rival thief and steal a purse in a museum. You won't get bored as you progress through each clever scenario.",
    "gameUrl": "https://cdn.thornandballoons.net/games/thief-puzzle/index.html",
    "howToPlay": "Click and hold the left mouse button to move the T and the bush hand towards the T and the target",
    "features": "Thief Puzzle is a fun and addictive puzzle game that includes escape games, brain tests, and robbery games to test your IQ and problem-solving skills. With each level presenting a different brain teaser, Thief Puzzle is perfect for players looking for popular games that are both satisfying and relaxing."
  }
]