[
  {
    "urlTag": "obby-draw-to-escape",
    "title": "Draw to Escape 🎯 Click here to play for free",
    "name": "Draw to Escape",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/obby-draw-to-escape/obby-draw-to-escape-432x240.jpg",
    "shortDesc": "Play the fun and relaxing casual game Draw to Escape and see if you can beat the levels with creativity alone. You may earn money as you beat the levels, and you can earn more coins as you find each star to reach the end of each level. Things may disappear or explode and kill you, so make sure to check each level carefully.",
    "description": "Have fun in Obby and draw your way to victory! Play the fun and relaxing casual game Draw to Escape and see if you can beat the levels with creativity alone. You may earn money as you beat the levels, and you can earn more coins as you find each star to reach the end of each level. Things may disappear or explode and kill you, so make sure to check each level carefully.\n\nInstructions: Use a pencil to draw platforms that you can walk on and avoid dangerous obstacles in the levels. Collect coins so you can buy new skins for your character. Controls: Use the mouse to draw A to move left D to move right Spacebar to make small jumps Use the game buttons to erase what you drew.",
    "gameUrl": "https://cdn.thornandballoons.net/games/obby-draw-to-escape/index.html",
    "howToPlay": "Use the mouse to draw A to move left D to move right Spacebar to make small jumps Use the game buttons to erase what you drew.",
    "features": "Draw Mode: In this mode you can draw intricate physics-based lines to guide your stickman through obstacles and solve the puzzles. Play Mode: In this mode you control your stickman move throughout the levels. 🌈 Infinite Creativity: With Drawnscape, the possibilities are endless."
  },{
    "urlTag": "twisted-rope",
    "title": "Twisted Rope 3D 🎯 Click here to play for free",
    "name": "Twisted Rope 3D",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/twisted-rope/twisted-rope-432x240.jpg",
    "shortDesc": "Are you ready for a mind-bending challenge! ? Twisted Rope Puzzle 3D is an addictive game that will test your puzzle-solving skills. Enter a colorful world of tangled ropes and solve increasingly complex puzzles.",
    "description": "Are you ready for a mind-bending challenge! ? Twisted Rope Puzzle 3D is an addictive game that will test your puzzle-solving skills. Enter a colorful world of tangled ropes and solve increasingly complex puzzles.Are you ready to test your brain with the most addictive 3D puzzle game? 🤔 Twisted Rope 3D takes you to a world of twisted ropes, tangled lines and tricky challenges where each level will push your logic to the limit! Featuring stunning 3D graphics 🎨, vivid ropes 🌈 and increasingly complex puzzles, this game guarantees hours of brain-stimulating fun!\n\n🔥 Endless fun with rope untangling challenges!\nEach level introduces a new rope puzzle that starts out easy but quickly escalates in difficulty. You’ll need to drag, untangle and separate the intertwined ropes while using strategy 🧠 to avoid creating an even bigger mess! The deeper you go, the more your rope handling skills will be tested.",
    "gameUrl": "https://cdn.thornandballoons.net/games/twisted-rope/index.html",
    "howToPlay": "Carefully examine the tangled mess. ? Tap and drag the ropes to untangle them. ?\n\n🕹️ Drag and resize - Use your fingers to reposition and untangle ropes in 3D space.\n🔍 Check for tangles - Look closely at twisted and overlapping ropes to find the best untangling strategy.\n🎯 Untangle with precision - Solve each tangled rope challenge step by step without making it worse!\n🏆 Complete each puzzle - Successfully untangle all ropes to unlock harder rope puzzles!\n🛠️ Use smart boosters - If you're struggling to solve a particularly twisted rope, take advantage of boosters to speed up the process.",
    "features": "Each level introduces a new rope puzzle that starts out easy but quickly escalates in difficulty. You'll need to drag, untangle and separate the intertwined ropes while using strategy 🧠 to avoid creating an even bigger mess! The deeper you go, the more your rope handling skills will be tested."
  },{
    "urlTag": "spotti-find-the-differences",
    "title": "Spotti Find The Differences 🎯 Click here to play for free",
    "name": "Spotti Find The Differences",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/spotti-find-the-differences/spotti-find-the-differences-432x240.avif",
    "shortDesc": "Find the Difference is a fun and relaxing puzzle game where you compare pairs of pictures and find the differences between them. Challenge your brain while enjoying stress-free gameplay at your own pace.",
    "description": "Spotti: Find the Difference is a fun and relaxing puzzle game where you compare pairs of pictures and find the differences between them. Challenge your brain while enjoying stress-free gameplay at your own pace.\n\n Relax and enjoy! Spot the Difference game improves concentration and observation skills while providing an engaging experience for players of all ages.",
    "gameUrl": "https://cdn.thornandballoons.net/games/spotti-find-the-differences/index.html",
    "howToPlay": "Use the left mouse button to select the differences.",
    "features": "Relaxed gameplay - no timers, no lives, no pressure; just enjoy the puzzles\nFree play - no locked levels; you can choose any image at your own pace\nZoom in for details - explore every corner of the scene with the handy zoom feature\nHints and help - use hints to spot tricky differences\nPortrait and landscape modes - play comfortably no matter how you hold your device\nCute Spotti - a friendly cat mascot"
  },
  {
    "urlTag": "thorn-and-balloons-hello-kitty-theme",
    "title": "Play Thorn and Balloons with Hello Kitty Theme games",
    "name": "Thorn and Balloons with Hello Kitty Theme",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/banner-thorn-and-balloons-hello-kitty-theme.jpg",
    "shortDesc": "Thorn and Balloons with Hello Kitty Theme is a fun casual game. The goal is to pop all balloons to win.",
    "description": "Thorn and Balloons with Hello Kitty Theme is a captivating casual game centered around the skillful manipulation of a thorn-covered ball. Players are tasked with precisely controlling the force and trajectory of each launch. Upon hitting a wall, the thorn ball ricochets off, and the goal is to burst all the balloons using these rebounds to secure victory.",
    "gameUrl": "https://cdn.thornandballoons.net/games/thorn-and-balloons-game-with-hello-kitty-theme/index.html",
    "howToPlay": "Thorn and Balloons with Hello Kitty Game Introduction: This is a cute puzzle game about puncturing balloons. The addition of Hello Kitty elements makes the game more cute and attractive. The gameplay is to throw darts to puncture balloons. Of course, there will be many obstacles in the process. You need to avoid collisions with obstacles that change the trajectory of the darts and make it impossible to puncture the balloons. Use your thinking, it will be very interesting",
    "features": "Thorn and Balloons with Hello Kitty level introduction. There are dozens of levels in the game. The higher the level, the higher the difficulty. I wish you good luck."
  },
  {
    "urlTag": "balloon-rotate-maze-classic-puzzle-game",
    "title": "Play Balloon Rotating Maze Classic Puzzle Game",
    "name": "Balloons Rotate Maze classic puzzle game",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/banner-balloon-rotate-maze-classic-puzzle-game.jpg",
    "shortDesc": "Balloons Rotate Maze is a classic puzzle game for quick brain breaks. Swipe through 2D retro mazes to pop balloons. Clear all to win! Simple, solo, and super fun!",
    "description": "Balloons Rotate Maze is a classic puzzle game, perfect for taking a quick break to train your brain. It’s designed to be a surprisingly simple solo game played by swiping through fun 2D retro labyrinths and popping balloons. Smash all the balloons in the maze and you will win!!!",
    "gameUrl": "https://cdn.thornandballoons.net/games/balloon-rotate-maze-classic-puzzle-game/index.html",
    "howToPlay": "Balloons Rotate Maze gameplay introduction, this is a very novel gameplay, you need to rotate the entire container of small balls to make the black ball pierce other balloons, there is no time limit, come and challenge it",
    "features": "Balloons Rotate Maze level introduction. The game has just been launched and there are more than a dozen levels. More levels will be updated later to open more functions. The game can turn off the sound."
  }
]