[
  {
    "urlTag": "sorting-balls",
    "title": "Ball Sort Puzzle - Click here to play for free",
    "name": "Sorting Balls",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/sorting-balls-512x512.jpg",
    "shortDesc": "Sorting Balls is a fun and challenging puzzle game where players must sort colored balls into the correct tubes. Play now!",
    "description": "Sorting Balls is a fun and challenging puzzle game where players must sort colored balls into the correct tubes. The goal is to arrange all the balls by color using logical thinking and strategic moves. As you progress through the levels, the puzzles become more complex and require careful planning. With simple controls and engaging mechanics, Sorting Balls is perfect for players who enjoy intellectual challenges.",
    "gameUrl": "https://cdn.thornandballoons.net/games/sorting-balls/index.html",
    "howToPlay": "Click on the tube to move the balls. You can only stack balls of the same color together if there are two or more balls of the same color. The main rule is to put all balls of the same color into one tube, cup or drinking bottle to successfully complete the sorting level.",
    "features": "FEATURES: • One finger control. • FREE & EASY TO PLAY. • NO time limit; you can enjoy Sort Balls Sorting Puzzle Game at your own pace! more."
  },
  {
    "urlTag": "obby-draw-to-escape",
    "title": "Draw to Escape 🎯 Click here to play for free",
    "name": "Draw to Escape",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/obby-draw-to-escape/obby-draw-to-escape-512x512.jpg",
    "shortDesc": "Play the fun and relaxing casual game Draw to Escape and see if you can beat the levels with creativity alone. You may earn money as you beat the levels, and you can earn more coins as you find each star to reach the end of each level. Things may disappear or explode and kill you, so make sure to check each level carefully.",
    "description": "Have fun in Obby and draw your way to victory! Play the fun and relaxing casual game Draw to Escape and see if you can beat the levels with creativity alone. You may earn money as you beat the levels, and you can earn more coins as you find each star to reach the end of each level. Things may disappear or explode and kill you, so make sure to check each level carefully.\n\nInstructions: Use a pencil to draw platforms that you can walk on and avoid dangerous obstacles in the levels. Collect coins so you can buy new skins for your character. Controls: Use the mouse to draw A to move left D to move right Spacebar to make small jumps Use the game buttons to erase what you drew.",
    "gameUrl": "https://cdn.thornandballoons.net/games/obby-draw-to-escape/index.html",
    "howToPlay": "Use the mouse to draw A to move left D to move right Spacebar to make small jumps Use the game buttons to erase what you drew.",
    "features": "Draw Mode: In this mode you can draw intricate physics-based lines to guide your stickman through obstacles and solve the puzzles. Play Mode: In this mode you control your stickman move throughout the levels. 🌈 Infinite Creativity: With Drawnscape, the possibilities are endless."
  },
  {
    "urlTag": "color-strings",
    "title": "Color Strings - Click here to play for free",
    "name": "Brain Puzzle Color Strings",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/color-strings/Color-Strings-game-512x512.jpg",
    "shortDesc": "In this puzzle game, you need to reshape the lines on the dots to match the pattern shapes. Each line on the puzzle board has a color.",
    "description": "In this puzzle game, you need to reshape the lines on the dots to match the pattern shapes. Each line on the puzzle board has a color, and you should use lines of the same color as the pattern. As you progress through each level, the shapes become more complex and more challenging for the player.",
    "gameUrl": "https://cdn.thornandballoons.net/games/color-strings/index.html",
    "howToPlay": "Your goal is to copy the image at the top of the screen. To do this, you need to move the rope on the grid! Click and drag the round end of the rope to move it to different holes, then release to place it. You can only place one end of the rope in one hole.",
    "features": "Looking for an easy way to exercise your brain every day? Try Color Strings! This game has simple rules but is fun and challenging to play. In this puzzle game, you need to rearrange the lines on the dots to match a given pattern. With a variety of puzzle levels, you can keep your brain sharp in just a few minutes a day."
  },
  {
    "urlTag": "blockup-puzzle",
    "title": "BlockUp Puzzle - Click here to play for free",
    "name": "BlockUp Puzzle",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/images/BlockUp-Puzzle-512x512.jpg",
    "shortDesc": "Drop the blocks to create vertically or horizontally lines of blocks without gaps. When such a line is created, it gets destroyed. ",
    "description": "Block Up Contrast is a minimalist arcade game where you need to move blocks upward through an endless series of obstacles. The challenge of the game is to avoid the contrasting colored obstacles and collect points. As the speed increases, the game requires precise timing and quick reactions. The gameplay of Block Up Contrast is simple and fascinating, which brings players an addictive experience.",
    "gameUrl": "https://cdn.thornandballoons.net/games/BlockUp-Puzzle/index.html",
    "howToPlay": "1. Tap to move the block upward. 2. Avoid obstacles of contrasting colors. 3. Time your taps carefully to navigate through gaps. 4. Collect points to increase your score. 5. React quickly as the speed increases over time.",
    "features": "Responsive Display.\nBeautiful Game Art.\nChallenging & Addictive Gameplay.\nThinkful Music.\nAvailable to Add Rewarded ads.\n3 Cool Boosters (Bomb, Refresh, and Gravity)\nAge: +5.\nSize: 7.5 MB."
  },
  {
    "urlTag": "tic-tac-toe-master",
    "title": "Tic Tac Toe Master puzzle 🎯 Click here to play for free",
    "name": "Tic Tac Toe Master puzzle",
    "rating": 4,
    "playCount": 52144,
    "imageUrl": "https://cdn.thornandballoons.net/games/tic-tac-toe-master/tic-tac-toe-master-512x512.jpeg",
    "shortDesc": "Challenge yourself on a traditional 3 X 3 grid or in custom board sizes from 5×5 to 8×8. TicTacToe Master is a highly skilled 2 player game where the goal is to take turns marking the correct spaces.",
    "description": "TicTacToe Master is a highly skilled 2 player game where the goal is to take turns marking the correct spaces, playing against the computer or a friend. Challenge yourself on a traditional 3 X 3 grid or in custom board sizes from 5×5 to 8×8. \nTic-tac-toe is a fun game that you can play any time and anywhere as long as you have a piece of paper, a pencil, and an opponent. Tic-tac-toe is a zero-sum game, which means that if both players are playing their best, then neither player will win. However, if you learn how to play tic-tac-toe and master some simple strategies, then you'll be able to not only play but win the majority of the time. If you want to know how to play tic-tac-toe, then see Step 1 to get started.",
    "gameUrl": "https://cdn.thornandballoons.net/games/tic-tac-toe-master/index.html",
    "howToPlay": "Draw the board. First, you have to draw the board, which is made up of a 3 x 3 grid of squares. This means it has three rows of three squares. Some people play with a 4 x 4 grid, but that is for more advanced players, and we will focus on the 3 x 3 grid here.\n\nHave the first player go first. Though traditionally, the first player goes with \"X\", you can allow the first player to decide whether to go with \"X\"s or to go with \"O\"s. These symbols will be placed on the table, in an attempt to have three of them in a row. If you're going first, then the best move you can make is to move into the center. This will maximize your chances of winning since you'll be able to create a row of three \"X\"s or \"O\"s in more combinations (4) this way than if you chose a different square.\n\nHave the second player go second. After the first player goes, then the second player should put down his symbol, which will be different from the symbol of the first player. The second player can either try to block the first player from creating a row of three or focus on creating their row of three. Ideally, the player can do both.",
    "features": "Different Board Sizes: Customize your game experience by choosing from multiple grid sizes.\nDual Game Mode: Play against AI or challenge a friend using the same device.\nSkill-based Gameplay: Refine your strategic thinking skills while having fun."
  },
  {
    "urlTag": "donut-box",
    "title": "Donut Box Puzzle - Click here to play for free",
    "name": "Donut Box Puzzle",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/donut-box/donut-box-512x512.jpg",
    "shortDesc": "Each level offers new arrangements of candies for you to slide and match.",
    "description": "Enjoy the delightful Donut Box, a casual HTML5 sliding game featuring a variety of beautiful donut and cupcake designs. Each level offers new arrangements of candies for you to slide and match. With its attractive graphics and fun gameplay, Donut Box is perfect for players looking for a lighthearted gaming experience. Try Donut Box today for a sweet and engaging gaming experience!",
    "gameUrl": "https://cdn.thornandballoons.net/games/donut-box/index.html",
    "howToPlay": "Players will take turns placing donut bricks into the display case, earning points based on the number of donuts of the same type that are connected together. In this game, you should place donuts and cupcakes into the box in the correct order to make the box ready. You should pay attention to the numbers and empty spaces on the box and slide donuts and cupcakes to pass the level. As you progress, you will collect coins by passing the levels. Use these coins to change the background texture and personalize your game.",
    "features": "These boxes are customizable in size, shape, and design to suit branding and product needs. Common features include logos, printed designs, or windows for product visibility. Donut boxes are lightweight, stackable, and ideal for retail or takeout, offering convenience while ensuring product presentation and protection."
  },
  {
    "urlTag": "blastify-2",
    "title": "Blastify 2 Puzzle - Click here to play for free",
    "name": "Blastify 2 Puzzle",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/blastify-2/blastify-2-512x512.jpg",
    "shortDesc": "Blastify II is a new addictive tap-to-blast puzzle game. It's easy to pick up and enjoyable for all ages. With endless new puzzles, you'll be able to play for hours.",
    "description": "Blastify II is a new addictive tap-to-blast puzzle game. It's easy to pick up and enjoyable for all ages. With endless new puzzles, you'll be able to play for hours. In this puzzle game, you need to destroy blocks of the same color on the puzzle board by clicking on them. You need to collect the remaining blocks until you hit the target. Utilize four unique boosters to break through obstacles and reach new heights.",
    "gameUrl": "https://cdn.thornandballoons.net/games/blastify-2/index.html",
    "howToPlay": "Blastify 2 is a fun and cute tap to blast puzzle game. The game is simple and easy to play, but full of fun and surprises. Just tap on blocks of the same color to crush...",
    "features": "Simple and fun gameplay.\n4 different boosters.\nAddictive Tap-to-blast puzzle game.\n50 challenging & fun levels.\nResponsive.\nNo time limit."
  },
  {
    "urlTag": "two-dots-remastered",
    "title": "Two Dots Remastered Puzzle - Click here to play for free",
    "name": "Two Dots Remastered Puzzle",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/two-dots-remastered/two-dots-remastered-512x512.jpg",
    "shortDesc": "Find two or more dots of the same color next to each other. Enjoy Two Dots Remastered, the ultimate matching game for players of all ages, and become a master at matching the dots!",
    "description": "Welcome to Two Dots Remastered, the fun and popular HTML5 matching game for players of all ages! Gameplay in Two Dots Remastered is simple: match two or more dots of the same color (not diagonally) and blast them apart! Enjoy Two Dots Remastered, the ultimate matching game for players of all ages, and become a master at matching the dots!",
    "gameUrl": "https://cdn.thornandballoons.net/games/two-dots-remastered/index.html",
    "howToPlay": "Find two or more dots of the same color next to each other (horizontally or vertically). Draw a line connecting the dots to blow them up and score points. Plan your moves to create longer chains for higher scores. Two Dots puzzle also features 4 in-game boosters as well as in-game items like anchors, boxes, and more. Use boosters strategically to clear challenging levels.",
    "features": "Two Dots puzzle also features 4 in-game boosters as well as in-game items like anchors, boxes, and more. Use boosters strategically to clear challenging levels."
  },
  {
    "urlTag": "puzzle-blocks-fill-it-completely",
    "title": "Puzzle blocks fill it completely - Click here to play for free",
    "name": "Puzzle blocks fill it completely",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/Puzzle-Blocks-Fill-It-Completely/Puzzle-Blocks-Fill-It-Completely-512x512.jpg",
    "shortDesc": "Choose a level. Each level provides a shape that needs to be filled. Complete the level by filling the shape without gaps!",
    "description": "Explore the exciting world of puzzles! In this game you have to collect shapes by filling them with blocks of different sizes and configurations. Each task is a unique logical task that requires concentration, patience and a strategic approach. Various difficulty levels - from easy for beginners to hard for real masters. Original shapes and blocks - each level is unique.",
    "gameUrl": "https://cdn.thornandballoons.net/games/Puzzle-Blocks-Fill-It-Completely/index.html",
    "howToPlay": "Choose a level. Each level provides a shape that needs to be filled. Use your mouse or touch screen to move blocks of different shapes and sizes. Place blocks inside the shape so that it fills up completely. If a block doesn't fit, move it aside and try another one. Complete the level by filling the shape without gaps!",
    "features": "The game features multiple levels of varying difficulty, from puzzles suitable for beginners to complex and puzzling challenges designed for experienced puzzle players..."
  },
  {
    "urlTag": "screw-puzzle-master",
    "title": "Screw puzzle master 🎯 Click here to play for free",
    "name": "Screw puzzle master",
    "rating": 4,
    "playCount": 52144,
    "imageUrl": "https://cdn.thornandballoons.net/games/screw-puzzle-master/screw-puzzle-master-512x512.jpg",
    "shortDesc": "Pull out nuts and bolts, loosen wood. Get ready for smooth and fun screw puzzles! It's time for some brain exercises.",
    "description": "Pull out nuts and bolts, loosen wood. Get ready for smooth and fun screw puzzles! It's time for some brain exercises. Many game levels, fun puzzles and super power-ups are waiting for you! Challenge your friends and complete the chapters as quickly as possible. Place the bolts as strategically as possible. Buy different skins and play in different environments.",
    "gameUrl": "https://cdn.thornandballoons.net/games/screw-puzzle-master/index.html",
    "howToPlay": "Pull out nuts and bolts to loosen wood, On desktop devices: Use MOUSE and LEFT-CLICK On mobile devices: Use Touch Controls to interact with the Nuts and Bolts.\n\n",
    "features": "Many game levels, interesting puzzles and super power-ups are waiting for you! Challenge your friends and complete the chapters as quickly as possible. Place the bolts as strategically as possible. Different skins and play in different environments."
  },
  {
    "urlTag": "sort-parking",
    "title": "Sort Parking 🎯 Click here to play for free",
    "name": "Sort Parking",
    "rating": 4,
    "playCount": 52144,
    "imageUrl": "https://cdn.thornandballoons.net/games/sort-parking/icon-sort-parking-512x512.jpg",
    "shortDesc": "Interesting and fun parking game. It's time to get out of the parking lot, but other cars are blocking your way!",
    "description": "It's time to get out of the parking lot, but other cars are blocking your way! Move them in the right order to clear the way! Tight parking spaces, challenging obstacles and unexpected challenges are waiting for you in this exciting and engaging game.",
    "gameUrl": "https://cdn.thornandballoons.net/games/sort-parking/index.html",
    "howToPlay": "The concept of assorted parking is fairly simple. You need to use logic to park cars of similar colors in a row, making sure there aren't weird cars stuck in the parking lot with mismatched colors.\n\nAt the start of the game, cars of all colors are parked together. You will have a row of cars of mixed colors: brown, red, yellow, and blue, but your goal is to park cars of the same color in the same row, so all red cars are parked in one row, brown cars in one row, and so on.\n\nThere are several rows that are empty - you need to fill these rows strategically. Once you place a color in an empty row, you have to add the same color in that row. Cars cannot be placed in front of cars of different colors, so once you start a row, make sure you have a plan to fill it.\n\nWhen you fill up an entire row with one color, the row is locked. Lock them all and complete the stage.",
    "features": "After completing a level, you can increase your points by tapping the highest spinning number. It seems easy, but these numbers spin pretty fast.\n\nWhat can you do with the points?\n\nYou can use game coins to unlock more car models. Complete levels to collect background pieces; when matched, you can change the background to a new theme."
  }
]