[
  {
    "urlTag": "merge-master",
    "title": "Merge Master - Click here to play for free",
    "name": "Merge Master",
    "rating": 4,
    "playCount": 49787,
    "imageUrl": "https://cdn.thornandballoons.net/games/Merge-Master/Merge-Master-512x512.jpg",
    "shortDesc": "Combine larger numbers by clicking on adjacent identical numbers on the main game board to eliminate them and create a new number that is twice as large.",
    "description": "A casual mobile game mainly based on elimination games. Merge Master is colorful and the pictures are rich in beach elements. The background music and sound effects remind people of the scene of a leisurely stroll on the beach, creating a relaxing and pleasant beach stroll atmosphere, allowing players to immerse themselves in auditory enjoyment.",
    "gameUrl": "https://cdn.thornandballoons.net/games/Merge-Master/index.html",
    "howToPlay": "The player's goal is to combine larger numbers by clicking on adjacent identical numbers on the main game board to eliminate them and create a new number that is twice as large.",
    "features": "Merge Master contains many levels and background music and sound effects reminiscent of leisurely walks along the beach, it creates a relaxed beach-strolling environment that immerses players in an auditory experience."
  },
  {
    "urlTag": "cube-combo",
    "title": "Cube Combo Puzzle - Click here to play for free",
    "name": "Cube Combo",
    "rating": 4,
    "playCount": 23052,
    "imageUrl": "https://cdn.thornandballoons.net/games/cube-combo/cube-combo-512x512.jpg",
    "shortDesc": "Move the cubes with numbers and merge the same cubes together until only one cube is left to complete the challenge.",
    "description": "Cube Combo is a casual puzzle game. In the game, players need to use their wisdom to move the cubes with numbers and merge the same cubes together until only one cube is left to complete the challenge. When there is only one number cube left on the board or the target number cube is synthesized, the current level is passed and a new level is opened.",
    "gameUrl": "https://cdn.thornandballoons.net/games/cube-combo/index.html",
    "howToPlay": "Drag the blocks to combine the same numbers until the combination goal is achieved. Enjoy Cube Combo!",
    "features": "In Cube Combo, there are more than ten themes, and different themes have different levels."
  },
  {
    "urlTag": "tile-fruits",
    "title": "Tile Fruits - Click here to play for free",
    "name": "Tile Fruits",
    "rating": 4,
    "playCount": 70613,
    "imageUrl": "https://cdn.thornandballoons.net/games/Tile-Fruits/Tile-Fruits-512x512.jpg",
    "shortDesc": "This 2D block matching game tests your strategic abilities as you connect three identical fruits. You will face increasing difficulty, new challenges and unique layouts.",
    "description": "Embark on a delicious adventure filled with vivid fruits and fascinating challenges in Tile Fruits! This 2D tile matching game tests your strategic abilities as you connect three identical fruits to advance through increasingly difficult levels. Each match removes fruit from the board, but be careful: having more than seven different types of fruit on the board at the same time will result in a loss.",
    "gameUrl": "https://cdn.thornandballoons.net/games/Tile-Fruits/index.html",
    "howToPlay": "Tile Fruits is simple and fun to play. Simply tap on a fruit to select it, then match three of the same fruit to remove it from the board. As you progress through levels, you'll face increasing difficulty, new challenges, and unique layouts.",
    "features": "Tile Fruits having more than seven different types of fruit on the board at the same time will result in a loss."
  },
  {
    "urlTag": "garden-tales-3",
    "title": "Garden Tales 3 - Click here to play for free",
    "name": "Garden Tales 3",
    "rating": 4,
    "playCount": 52144,
    "imageUrl": "https://cdn.thornandballoons.net/games/Garden-Tales-3/Garden-Tales-3-512x512.jpeg",
    "shortDesc": "Collect flowers, fruits and mushrooms to help your gnome friend Willy weed the magic garden. Make combinations of at least 3 of the same plants to make them disappear.",
    "description": "Garden Tales 3 is the most anticipated Match 3 game of the year. This highly anticipated third sequel features over 3,000 incredible levels for you to play. Collect flowers, fruits and mushrooms to help your gnome friend Willy weed the magic garden. The more flowers and fruits of the same type you combine, the cooler bonuses you get. Turn on the famous catchy soundtrack and enjoy the best Match 3 games!",
    "gameUrl": "https://cdn.thornandballoons.net/games/Garden-Tales-3/index.html",
    "howToPlay": "Use touch controls or mouse to swap and match fruits and plants. Make combinations of at least 3 of the same plants to make them disappear. Climb through legendary maps to increasingly difficult levels. Use boosters to help you. Complete daily missions and daily challenges to win extra coins and other gifts. Play the best Match 3 game ever!",
    "features": "It follows a similar format to fun themed adventure match-3 games like Jewels Blitz 4 and Yummy Tales. In Garden Tales 3, players explore a garden inhabited by gnomes. The main goal of the player is to help the gnomes obtain different types of flowers, fruits, leaves, and mushrooms throughout hundreds of levels."
  },
  {
    "urlTag": "screw-puzzle-master",
    "title": "Screw puzzle master 🎯 Click here to play for free",
    "name": "Screw puzzle master",
    "rating": 4,
    "playCount": 52144,
    "imageUrl": "https://cdn.thornandballoons.net/games/screw-puzzle-master/screw-puzzle-master-512x512.jpg",
    "shortDesc": "Pull out nuts and bolts, loosen wood. Get ready for smooth and fun screw puzzles! It's time for some brain exercises.",
    "description": "Pull out nuts and bolts, loosen wood. Get ready for smooth and fun screw puzzles! It's time for some brain exercises. Many game levels, fun puzzles and super power-ups are waiting for you! Challenge your friends and complete the chapters as quickly as possible. Place the bolts as strategically as possible. Buy different skins and play in different environments.",
    "gameUrl": "https://cdn.thornandballoons.net/games/screw-puzzle-master/index.html",
    "howToPlay": "Pull out nuts and bolts to loosen wood, On desktop devices: Use MOUSE and LEFT-CLICK On mobile devices: Use Touch Controls to interact with the Nuts and Bolts.\n\n",
    "features": "Many game levels, interesting puzzles and super power-ups are waiting for you! Challenge your friends and complete the chapters as quickly as possible. Place the bolts as strategically as possible. Different skins and play in different environments."
  },
  {
    "urlTag": "tic-tac-toe-master",
    "title": "Tic Tac Toe Master puzzle 🎯 Click here to play for free",
    "name": "Tic Tac Toe Master puzzle",
    "rating": 4,
    "playCount": 52144,
    "imageUrl": "https://cdn.thornandballoons.net/games/tic-tac-toe-master/tic-tac-toe-master-512x512.jpeg",
    "shortDesc": "Challenge yourself on a traditional 3 X 3 grid or in custom board sizes from 5×5 to 8×8. TicTacToe Master is a highly skilled 2 player game where the goal is to take turns marking the correct spaces.",
    "description": "TicTacToe Master is a highly skilled 2 player game where the goal is to take turns marking the correct spaces, playing against the computer or a friend. Challenge yourself on a traditional 3 X 3 grid or in custom board sizes from 5×5 to 8×8. \nTic-tac-toe is a fun game that you can play any time and anywhere as long as you have a piece of paper, a pencil, and an opponent. Tic-tac-toe is a zero-sum game, which means that if both players are playing their best, then neither player will win. However, if you learn how to play tic-tac-toe and master some simple strategies, then you'll be able to not only play but win the majority of the time. If you want to know how to play tic-tac-toe, then see Step 1 to get started.",
    "gameUrl": "https://cdn.thornandballoons.net/games/tic-tac-toe-master/index.html",
    "howToPlay": "Draw the board. First, you have to draw the board, which is made up of a 3 x 3 grid of squares. This means it has three rows of three squares. Some people play with a 4 x 4 grid, but that is for more advanced players, and we will focus on the 3 x 3 grid here.\n\nHave the first player go first. Though traditionally, the first player goes with \"X\", you can allow the first player to decide whether to go with \"X\"s or to go with \"O\"s. These symbols will be placed on the table, in an attempt to have three of them in a row. If you're going first, then the best move you can make is to move into the center. This will maximize your chances of winning since you'll be able to create a row of three \"X\"s or \"O\"s in more combinations (4) this way than if you chose a different square.\n\nHave the second player go second. After the first player goes, then the second player should put down his symbol, which will be different from the symbol of the first player. The second player can either try to block the first player from creating a row of three or focus on creating their row of three. Ideally, the player can do both.",
    "features": "Different Board Sizes: Customize your game experience by choosing from multiple grid sizes.\nDual Game Mode: Play against AI or challenge a friend using the same device.\nSkill-based Gameplay: Refine your strategic thinking skills while having fun."
  },
  {
    "urlTag": "sweetsu-tile-puzzle",
    "title": "Sweetsu Tile Puzzle - Click here to play for free",
    "name": "Sweetsu Tile Puzzle",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/Sweetsu-Tile-Puzzle/Sweetsu-Tile-Puzzle-512x512.jpg",
    "shortDesc": "Look for potential matches several moves ahead. Prioritize Special Blocks: Use special blocks strategically to clear the largest areas on the board.",
    "description": "Sweet Tile Puzzle is a relaxing yet strategic game. Match 3 identical Japanese themed tiles by drawing them into limited stacks. Collect all tiles and manage space wisely to clear the board. With each level, the challenge increases as the stacks shrink and more tiles appear. Can you master the art of tile matching?",
    "gameUrl": "https://cdn.thornandballoons.net/games/Sweetsu-Tile-Puzzle/index.html",
    "howToPlay": "Tips for Success:\nPlan Ahead: Look for potential matches several moves ahead.\nPrioritize Special Blocks: Use special blocks strategically to clear the largest areas on the board.\nUtilize Power-ups: Use power-ups wisely to overcome challenging obstacles.\nPractice and Patience: The more you play, the better you will understand the game's mechanics and develop effective strategies.\nHow to Play Sweetsu Tile Puzzle\nMouse and Keyboard: Click a block to select it, then click an adjacent block to create a match.",
    "features": "Sweet Tile Puzzle's highlights · Engaging puzzle gameplay · Bright 2D graphics and cheerful background music · Lots of cute food and animal images..."
  },
  {
    "urlTag": "mushroom-fever-match-3",
    "title": "Mushroom Fever Match 3 - Click here to play for free",
    "name": "Mushroom Fever Match 3",
    "rating": 4,
    "imageUrl": "https://cdn.thornandballoons.net/games/mushroom-fever-match-3/Mushroom-Fever-Match-3-512x512.jpg",
    "shortDesc": "Match groups of three or more mushrooms to complete fun missions and unlock new levels! Each level features unique puzzles and fresh challenges.",
    "description": "Immerse yourself in the magical forest of Mushroom Mania - Match 3! Bright and cheerful mushrooms replace traditional crystals, adding a fresh twist to the classic match-3 genre. This game will provide you with hours of exciting fun and excitement! Match groups of three or more mushrooms to complete fun quests and unlock new levels! Each level features unique puzzles and fresh challenges. The more mushrooms you match, the more points and rewards you get!",
    "gameUrl": "https://cdn.thornandballoons.net/games/mushroom-fever-match-3/index.html",
    "howToPlay": "Collect Mushrooms: Your goal is to gather as many groups of three or more matching mushrooms as possible. Swap them around to create rows or columns of identical mushrooms.",
    "features": "Each stage features new puzzles and challenging objectives. Maximize your points with exclusive bonuses and devise winning strategies to progress through ..."
  }
]