[
  {
    "urlTag": "save-the-princess",
    "title": "Save The Princess - Click here to play for free",
    "name": "Save The Princess",
    "rating": 4,
    "playCount": 49787,
    "imageUrl": "https://cdn.thornandballoons.net/games/save-the-princess/icon-save-the-princess.webp",
    "shortDesc": "Using your creativity and problem-solving skills, draw a line on the playfield to create a path for the Prince to follow.",
    "gameUrl": "https://cdn.thornandballoons.net/games/save-the-princess/index.html",
    "description": "<div style=\"text-align: center; font-family: Arial, sans-serif; color: #333;\">\n        <h1 style=\"font-size: 36px; margin-bottom: 20px; color: #ff6347;\">Save the Princess</h1>\n        <p style=\"font-size: 20px; margin-bottom: 30px;\">Save the Princess is a captivating game of love, strategy, and line-drawing through 40+ challenging levels! In Save the Princess, the Princess awaits her Prince atop a towering fortress, and it's your mission to reunite them. Using your creativity and problem-solving skills, draw a line on the playfield to create a path for the Prince to follow. But be careful - letting go of the line at the right moment is crucial, as there are numerous moving obstacles standing in the way of true love.</p>\n        <div style=\"background-color: #f9f9f9; padding: 20px; border-radius: 10px; max-width: 800px; margin: 0 auto;\">\n            <p style=\"font-size: 18px; line-height: 1.6;\">Each of the 40+ levels in Save the Princess offers a unique challenge that will put your dexterity and timing to the test. Master the art of line drawing and develop strategies to overcome increasingly complex barriers as you progress through the game. With every successful reunion in Save the Princess, you'll get one step closer to the ultimate romantic triumph!</p>\n            <p style=\"font-size: 18px; line-height: 1.6; margin-top: 20px;\">Don't miss out on this enchanting journey of love and strategy. Join Save the Princess today and experience the thrill of reuniting the Prince and Princess against all odds!</p>\n        </div>\n        <div style=\"margin-top: 30px;\">\n            <h2 style=\"font-size: 28px; margin-bottom: 20px; color: #4caf50;\">Features of Save the Princess</h2>\n            <ul style=\"list-style-type: none; padding: 0;\">\n                <li style=\"background-color: #e0f7fa; padding: 10px; margin-bottom: 10px; border-radius: 5px; font-size: 18px;\">Puzzle</li>\n                <li style=\"background-color: #e0f7fa; padding: 10px; margin-bottom: 10px; border-radius: 5px; font-size: 18px;\">Girls</li>\n                <li style=\"background-color: #e0f7fa; padding: 10px; margin-bottom: 10px; border-radius: 5px; font-size: 18px;\">Suitable for all ages</li>\n            </ul>\n        </div>\n    </div>"
  },
  {
    "urlTag": "spring-illustration-pieces-puzzle",
    "title": "Spring Pieces Puzzle - Click here to play for free",
    "name": "Spring Pieces Puzzle",
    "rating": 4,
    "playCount": 23052,
    "imageUrl": "https://cdn.thornandballoons.net/games/spring-illustration-pieces-puzzle/icon-spring-illustration-pieces-puzzle.jpg",
    "shortDesc": "Discover fun and educational spring themed classroom games and puzzles, free online games for kids to learn and practice.",
    "gameUrl": "https://cdn.thornandballoons.net/games/spring-illustration-pieces-puzzle/index.html",
    "description": "<div style=\"text-align: center; font-family: Arial, sans-serif; color: #333; padding: 20px;\">\n        <h1 style=\"font-size: 36px; margin-bottom: 20px; color: #4caf50;\">Spring Pieces Puzzle</h1>\n        <p style=\"font-size: 20px; margin-bottom: 30px;\">\n            This set of <strong>Spring Pieces Puzzle</strong> games is an easy activity to put together for your young students. These puzzle printables help build concentration, fine motor, and problem-solving skills. While the brain-boosting benefits are many, the BEST part of this fun activity is experiencing your child beaming with pride as they finish the task to reveal a lovely spring picture!\n        </p>\n        <img src=\"https://cdn.thornandballoons.net/games/spring-illustration-pieces-puzzle/banner-spring-illustration-pieces-puzzle.png\" alt=\"Spring Puzzle\" style=\"width: 100%; max-width: 600px; height: auto; margin-bottom: 20px;\">\n        \n        <p style=\"font-size: 18px; line-height: 1.6;\">\n            Each picture puzzle in the <strong>Spring Pieces Puzzle</strong> set is missing eight pieces. There are eight small squares to cut out, which you can either do ahead of time for your students or have them do it. (Great scissors practice opportunity. 🙂 ) Instruct your student to complete the puzzle by finding the missing parts of the spring picture and placing the correct square onto the puzzle. This can also be used as a cut and paste activity for older children.\n        </p>\n        <p style=\"font-size: 18px; line-height: 1.6;\">\n            This printable set of worksheets, known as <strong>Spring Pieces Puzzle</strong>, is ideal for parents, early childhood educators, and homeschoolers looking for a simple prep activity. Use it during quiet time, in classroom activity centers, or during independent learning time while working with other students. Print the entire set, cut out the pieces, and laminate them for longevity in classroom and Montessori settings.\n        </p>\n        <p style=\"font-size: 18px; line-height: 1.6;\">\n            Discover fun and educational spring-themed classroom games and puzzles like the <strong>Spring Pieces Puzzle</strong>, free online games for kids to learn and practice.\n        </p>\n        <p style=\"font-size: 18px; line-height: 1.6;\">\n            Play with 9 images in this perfect jigsaw puzzle game: <strong>Spring Pieces Puzzle</strong>. All images are with the spring illustration. Solve all puzzles and keep your brain sharp. You have four modes for each picture: 16 pieces, 36 pieces, 64 pieces, and 100 pieces. Enjoy and have fun with the <strong>Spring Pieces Puzzle</strong>!\n        </p>\n    </div>"
  }
]